idopshik/stm32_wss_emu/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
    //
// ===== CAN RX =====
typedef struct {
    uint32_t id;
    uint8_t  dlc;
    uint8_t  data[8];
} can_msg_t;

extern volatile uint8_t can_rx_pending;
extern can_msg_t can_rx_msg;

// ===== CAN TX =====
extern volatile uint8_t can_tx_status_pending;
extern volatile uint8_t can_tx_error_pending;
extern uint8_t can_tx_error_code;

// Прототипы функций
void process_can_in_main(void);

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define User_Button_Pin GPIO_PIN_13
#define User_Button_GPIO_Port GPIOC
#define EXT_LED_Pin GPIO_PIN_1
#define EXT_LED_GPIO_Port GPIOA
#define tim3_out_Pin GPIO_PIN_6
#define tim3_out_GPIO_Port GPIOA
#define SOLID_RELAY_CONTROL_Pin GPIO_PIN_10
#define SOLID_RELAY_CONTROL_GPIO_Port GPIOB
#define LED_Blue_Pin GPIO_PIN_6
#define LED_Blue_GPIO_Port GPIOC
#define tim1_out_Pin GPIO_PIN_8
#define tim1_out_GPIO_Port GPIOA
#define Out_1_Pin GPIO_PIN_6
#define Out_1_GPIO_Port GPIOB
#define Out_2_Pin GPIO_PIN_7
#define Out_2_GPIO_Port GPIOB
#define tim4_out_Pin GPIO_PIN_9
#define tim4_out_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
